Revit 2026 API

# IFCExtrusionCreationData Constructor

---

The default constructor.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IFCExtrusionCreationData()
```
```vb
Public Sub New
```
```cpp
public:
IFCExtrusionCreationData()
```
```fsharp
new : unit -> IFCExtrusionCreationData
```

All input data will be considered uninitialized.

#### Reference

IFCExtrusionCreationData Class

Autodesk.Revit.DB.IFC Namespace